Merge remote-tracking branch 'origin/docs/restructure-api-rust-3161168032414921979' into feature/integrations-panel-fix-17593507967815292912
